Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_de_traduccion/doc-compendium.tmx
Source language: en
Languages: es_es

source: This finds the file "stdio.h" in your value of 'path'. The quotes are necessary to have one argument |-+c|.
es_es: Esto encuentra el archivo «stdio.h» en su valor de 'path'. Las comillas son necesarias para tener un argumento |-+c|.

source: *22.4* The buffer list
es_es: *22.4* La lista de búfers.

source: The Vim editor uses the term buffer to describe a file being edited. Actually, a buffer is a copy of the file that you edit. When you finish changing the buffer, you write the contents of the buffer to the file. Buffers not only contain file contents, but also all the marks, settings, and other stuff that goes with it.
es_es: El editor Vim usa el término búfer para describir un archivo en edición. En realidad, un búfer es una copia del archivo que edita. Cuando termina de modificar el búfer, escribe los contenidos del búfer en el archivo. Los búfers no solo contienen los contenidos de al archivo, sino también las marcas, configuraciones y otros elementos que lo acompañan.

source: :hide edit two.txt
es_es: :hide edit dos.txt

source: The buffer "one.txt" disappears from the screen, but Vim still knows that you are editing this buffer, so it keeps the modified text. This is called a hidden buffer: The buffer contains text, but you can't see it. The argument of ":hide" is another command. ":hide" makes that command behave as if the 'hidden' option was set. You could also set this option yourself. The effect is that when any buffer is abandoned, it becomes hidden. Be careful! When you have hidden buffers with changes, don't exit Vim without making sure you have saved all the buffers.
es_es: El búfer «uno.txt» desaparece de la pantalla, pero Vim sabe aún sabe que esté editando el búfer, así que guarda el texto modificado. A esto se le llama un búfer oculto: El búfer contiene texto, pero no puede verlo. El argumento de «:hide» es otra orden. «:hide» hace que una orden se comporte como si la opción 'hidden' estuviese activada. También podría configurar usted mismo esta opción. El efecto que esto tiene es que cuando cualquier búfer, éste se ocultará. ¡Cuidado! Cuando tenga búfers ocultos con cambios, no cierre Vim antes de asegurarse de haber guardado todos los búfers.

source: When a buffer has been used once, Vim remembers some information about it. When it is not displayed in a window and it is not hidden, it is still in the buffer list. This is called an inactive buffer. Overview:
es_es: Si un búfer se ha usado una vez, Vim recordará alguna información del búfer. Cuando no está activa en una ventana y no oculta, aún se encontrará en la lista de búfers. A esto se le llama un búfer inactivo. Vista general:

source: Active Appears in a window, text loaded. Hidden Not in a window, text loaded. Inactive Not in a window, no text loaded.
es_es: Activo Aparece en una ventana, texto cargado. Hidden No aparece en una ventana, texto cargado. Inactive No aparece en una ventana, texto no cargado.

source: The output could look like this:
es_es: La salida puede presentar este aspecto:

source: 1 #h "help.txt" line 62 ~ 2 %a+ "usr_21.txt" line 1 ~ 3 "usr_toc.txt" line 1 ~
es_es: 1 #h "help.txt" línea 62 ~ 2 %a+ "usr_21.txt" línea 1 ~ 3 "usr_toc.txt" línea 1 ~

source: The first column contains the buffer number. You can use this to edit the buffer without having to type the name, see below. After the buffer number come the flags. Then the name of the file and the line number where the cursor was the last time. The flags that can appear are these (from left to right):
es_es: La primera columna contiene el número de búfer. Puede usar esto para editar el búfer sin tener que introducir el nombre, explicado a continuación. Después del número aparecen las opciones. Por último, el nombre del archivo y el número de línea en el que estaba el cursor al última vez. Se permiten las siguientes opciones (de izquierda a derecha):

source: u Buffer is unlisted |unlisted-buffer|. % Current buffer. # Alternate buffer. a Buffer is loaded and displayed. h Buffer is loaded but hidden. = Buffer is read-only. - Buffer is not modifiable, the 'modifiable' option is off. + Buffer has been modified.
es_es: u Buffer no está listado |unlisted-buffer|. % Búfer actual. # Búfer alternativo. a El búfer está cargado y visible. h El búfer está cargado pero oculto. = El búfer es de sólo lectura. - El búfer no es modificable, la opción 'modifiable' está desactivada. + El búfer se ha modificado.

source: You can edit a buffer by its number. That avoids having to type the file name: >
es_es: Puede editar un búfer por su número. Esto evita tener que introducir el nombre del archivo: >

source: But the only way to know the number is by looking in the buffer list. You can use the name, or part of it, instead: >
es_es: Pero la única manera de saber el número es a través de la lista de de búfers. En lugar de esto, puede usar el nombre, o parte de él: >

source: Vim will find the best match for the name you type. If there is only one buffer that matches the name, it will be used. In this case "help.txt". To open a buffer in a new window: >
es_es: Vim mostrará la coincidencia más cercana al nombre que introduzca. De sólo haber un búfer que coincida con el nombre, este se usará. En este caso, «help.txt». Use lo siguiente para abrir un búfer en una nueva ventana: >

source: :bnext go to next buffer :bprevious go to previous buffer :bfirst go to the first buffer :blast go to the last buffer
es_es: :bnext Ir al siguiente búfer :bprevious Ir al búfer anterior :bfirst Ir al primer búfer :blast Ir al último búfer

source: Again, this also works with a name. If you delete a buffer that was active (visible in a window), that window will be closed. If you delete the current buffer, the current window will be closed. If it was the last window, Vim will find another buffer to edit. You can't be editing nothing!
es_es: Una vez más, esto también funciona con un nombre. Si elimina un búfer que estaba activo (visible en una ventana), esa ventana se cerrará. Si elimina el búfer actual, se cerrará la ventana actual. Si era la última ventana, Vim encontrará otro búfer que editar. ¡No puede editar la nada!

source: Note: Even after removing the buffer with ":bdelete" Vim still remembers it. It's actually made "unlisted", it no longer appears in the list from ":buffers". The ":buffers!" command will list unlisted buffers (yes, Vim can do the impossible). To really make Vim forget about a buffer, use ":bwipe". Also see the 'buflisted' option.
es_es: Nota: Aún después de eliminar un búfer con «:bdelete», Vim aún lo recuerda. En realidad, pasa a no «unlisted» (no listado), ya que no aparece en la lista de «:buffers». La orden «:buffers!» muestra los búfers no listados (sí, Vim es capaz de lo imposible). Para hacer que Vim olvide completamente un búfer, use «:bwipe». Véase también la opción 'buflisted'.

source: *usr_90.txt* For Vim version 7.3. Last change: 2008 Sep 10
es_es: *usr_90.esx* Para Vim versión 7.3. Último cambio: 10/09/2008

source: Installing Vim
es_es: Instalar Vim

source: *install* Before you can use Vim you have to install it. Depending on your system it's simple or easy. This chapter gives a few hints and also explains how upgrading to a new version is done.
es_es: *instalar* *install* Antes de usar Vim, tiene que instalarlo. Es sencillo o fácil dependiendo de su sistema. Este capítulo ofrece algunas indicaciones y explica cómo se actualiza a una nueva versión.

source: |90.1| Unix |90.2| MS-Windows |90.3| Upgrading |90.4| Common installation issues |90.5| Uninstalling Vim
es_es: |90.1| Unix |90.2| MS-Windows |90.3| Actualizar |90.4| Problemas de instalación habituales |90.5| Desinstalar Vim

source: Previous chapter: |usr_45.txt| Select your language Table of contents: |usr_toc.txt|
es_es: Capítulo siguiente: |usr_45.esx| Seleccione su idioma Tabla de contenidos: |usr_toc.esx|

source: First you have to decide if you are going to install Vim system-wide or for a single user. The installation is almost the same, but the directory where Vim is installed in differs. For a system-wide installation the base directory "/usr/local" is often used. But this may be different for your system. Try finding out where other packages are installed. When installing for a single user, you can use your home directory as the base. The files will be placed in subdirectories like "bin" and "shared/vim".
es_es: Primero debe decidir si va a instalar Vim para uno o todos los usuarios. La instalación es muy similar, pero difiere el directorio de instalación de Vim. Para una instalación de sistema (todos los usuarios), a menudo se usa el directorio base «/usr/local». Pero puede ser distinto en su sistema. Intente averiguar dónde se instalan los otros paquetes. Cuando realiza una instalación para un sólo usuario, puede usar su directorio personal como base. Los ficheros se ubicarań en subdirectorios como «bin» y «shared/vim».

source: You can get precompiled binaries for many different UNIX systems. There is a long list with links on this page:
es_es: Puede obtener binarios precompilados para muchos sistemas UNIX diferentes. En esta página hay una larga lista con enlaces:

source: Volunteers maintain the binaries, so they are often out of date. It is a good idea to compile your own UNIX version from the source. Also, creating the editor from the source allows you to control which features are compiled. This does require a compiler though.
es_es: Los responsables de los binarios son voluntarios, por lo que a menudo están obsoletos. Es una buena idea compilar su propia versión UNIX desde las fuentes. Así mismo, crear el editor desde las fuentes le permite controlar las características a compilar. Por otra parte, esto requiere un compilador.

source: If you have a Linux distribution, the "vi" program is probably a minimal version of Vim. It doesn't do syntax highlighting, for example. Try finding another Vim package in your distribution, or search on the web site.
es_es: Si tiene una distribución de Linux, el programa vi es probablemente una versión mínima de Vim. No ejecuta el resaltado de sintaxis, por ejemplo. Intente buscar otro paquete de Vim en su distribución, o busque en la página web.

source: - A C compiler (GCC preferred) - The GZIP program (you can get it from www.gnu.org) - The Vim source and runtime archives
es_es: - Un compilador C (preferentemente GCC) - El programa GZIP (puede obtenerlo en www.gnu.org) - Los archivos de Vim fuente y de tiempo de ejecución

source: Or use the home site ftp.vim.org, if you think it's fast enough. Go to the "unix" directory and you'll find a list of files there. The version number is embedded in the file name. You will want to get the most recent version. You can get the files for Unix in two ways: One big archive that contains everything, or four smaller ones that each fit on a floppy disk. For version 6.1 the single big one is called:
es_es: O use la página oficial ftp.vim.org, si cree que es suficientemente rápida. Vaya al directorio «unix», y encontrará una serie de archivos. El número de versión está integrado en el nombre del archivo. Querrá obtener la versión más reciente. Puede obtener los archivos para Unix de dos formas: Un único archivo grande que contiene todo, o cuatro más pequeños que caben en un disquete. El archivo de la versión 6.1 se llama:

source: You need the bzip2 program to uncompress it. If you don't have it, get the four smaller files, which can be uncompressed with gzip. For Vim 6.1 they are called:
es_es: Necesita el programa bzip2 para descomprimirlo. Si no lo tiene, descargue los cuatro archivos más pequeños, que se pueden descomprimir con gzip. Para Vim 6.1, se llaman:

source: Then unpack the archives there. If you have the one big archive, you unpack it like this: >
es_es: Descomprima los archivos en esa ubicación. Si tiene el archivo único grande, lo puede desempaquetar de la siguiente forma: >

source: bzip2 -d -c path/vim-6.1.tar.bz2 | tar xf -
es_es: bzip2 -d -c ruta/vim-6.1.tar.bz2 | tar xf -

source: gzip -d -c path/vim-6.1-src1.tar.gz | tar xf - gzip -d -c path/vim-6.1-src2.tar.gz | tar xf - gzip -d -c path/vim-6.1-rt1.tar.gz | tar xf - gzip -d -c path/vim-6.1-rt2.tar.gz | tar xf -
es_es: gzip -d -c ruta/vim-6.1-src1.tar.gz | tar xf - gzip -d -c ruta/vim-6.1-src2.tar.gz | tar xf - gzip -d -c ruta/vim-6.1-rt1.tar.gz | tar xf - gzip -d -c ruta/vim-6.1-rt2.tar.gz | tar xf -

source: The make program will run configure and compile everything. Further on we will explain how to compile with different features. If there are errors while compiling, carefully look at the error messages. There should be a hint about what went wrong. Hopefully you will be able to correct it. You might have to disable some features to make Vim compile. Look in the Makefile for specific hints for your system.
es_es: El programa «make» ejecutará «configure» y compilará todo. Más adelante explicaremos como compilar con diferentes funcionalidades. Si detecta errores durante la compilación, mire con detenimiento los mensajes de error. Debería haber una indicación de qué falló. Con suerte, podrá corregirlos. Puede que tenga que desactivar algunas funcionalidades para poder compilar Vim. Consulte el archivo «Makefile» para ver indicaciones específicas a su sistema.

source: This will run a sequence of test scripts to verify that Vim works as expected. Vim will be started many times and all kinds of text and messages flash by. If it is alright you will finally see:
es_es: Esto ejecutará una secuencia de scripts de prueba para comprobar que Vim funciona de la manera esperada. Se iniciará Vim varias veces, y aparecerán rápidamente todo tipo de texto y mensajes. Si todo es correcto, verá:

source: If you get "TEST FAILURE" some test failed. If there are one or two messages about failed tests, Vim might still work, but not perfectly. If you see a lot of error messages or Vim doesn't finish until the end, there must be something wrong. Either try to find out yourself, or find someone who can solve it. You could look in the |maillist-archive| for a solution. If everything else fails, you could ask in the vim |maillist| if someone can help you.
es_es: Si le devuelve «TEST FAILURE», es que ha fallado alguna prueba. Si existen uno o más mensajes de pruebas fallidas, puede que Vim funcione, pero no a la perfección. Si ve muchos mensajes de error o Vim no continua hasta el final, puede que exista algún problema. Puede intentar encontrarlo manualmente, o encontrar a alguien que lo puede solucionar. También puede consultar la lista de correo (|maillist-archive|) en busca de una solución. Si todo falla, puede preguntar en la lista de correo (|maillist|) de Vim si alguien le puede ayudar.

source: INSTALLING *install-home* If you want to install in your home directory, edit the Makefile and search for a line:
es_es: INSTALACIÓN *install-home* Si desea instalar Vim en su directorio personal (o «home»), edite el archivo «Makefile» y busque la siguiente línea:

source: Remove the # at the start of the line. When installing for the whole system, Vim has most likely already selected a good installation directory for you. You can also specify one, see below. You need to become root for the following.
es_es: Elimine «#» al principio de la línea. Al instalar para todo el sistema, los más probable es que Vim haya seleccionado un directorio de instalación adecuado. También puede definir uno; vea a continuación. Necesita ser el administrador para poder realizar lo siguiente.

source: That should move all the relevant files to the right place. Now you can try running vim to verify that it works. Use two simple tests to check if Vim can find its runtime files: >
es_es: Esto debería mover todos los archivos relevantes al sitio adecuado. Ahora puede intentar ejecutar Vim para comprobar que funciona. Use dos pruebas sencillas para comprobar que Vim puede encontrar sus archivos de tiempo de ejecución.

source: Don't forget that the user manual assumes you Vim in a certain way. After installing Vim, follow the instructions at |not-compatible| to make Vim work as assumed in this manual.
es_es: No olvide que el manual del usuario supone que usa Vim de una cierta manera. Tras instalar Vim, siga las instrucciones en |not-compatible| para que Vim funcione de la forma aceptada en este manual.

source: Vim has many ways to select features. One of the simple ways is to edit the Makefile. There are many directions and examples. Often you can enable or disable a feature by uncommenting a line. An alternative is to run "configure" separately. This allows you to specify configuration options manually. The disadvantage is that you have to figure out what exactly to type. Some of the most interesting configure arguments follow. These can also be enabled from the Makefile.
es_es: Vim ofrece varias formas de seleccionar funcionalidades. Una de las más sencillas es editar el archivo «Makefile». Hay muchas indicaciones y ejemplos. Generalmente, puede activar o desactivar una funcionalidad simplemente descomentando una línea. Otra alternativa es ejecutar «configure» de forma separada. Le permite especificar opciones de configuración manualmente. La desventaja es que tiene que averiguar qué teclear exactamente. A continuación tiene algunas de los argumentos más interesantes. También se pueden activar desde el archivo «Makefile».

source: --prefix={directory} Top directory where to install Vim.
es_es: --prefix={directorio} Directorio superior donde instalar Vim.

source: --with-features=tiny Compile with many features disabled. --with-features=small Compile with some features disabled. --with-features=big Compile with more features enabled. --with-features=huge Compile with most features enabled. See |+feature-list| for which feature is enabled in which case.
es_es: --with-features=tiny Compilación con varias funcionalidades desactivadas. --with-features=small Compilación con algunas funcionalidades desactivadas. --with-features=big Compilación con más funcionalidades activadas. --with-features=huge Compilación con la mayoría de funcionalidades activadas. Consulte |+feature-list| para ver qué funcionalidad está activa por omisión.

source: --enable-perlinterp Enable the Perl interface. There are similar arguments for ruby, python and tcl.
es_es: --enable-perlinterp Activa la interfaz de Perl. Existen argumentos similares para Ruby, Python y tcl.

source: --disable-gui Do not compile the GUI interface. --without-x Do not compile X-windows features. When both of these are used, Vim will not connect to the X server, which makes startup faster.
es_es: --disable-gui No compila la interfaz gráfica. --without-x No compila las funcionalidades del sistema de ventanas X. Si se usan las dos, Vim no se conectará al servidor de X, lo cual agiliza el inicio.

source: You can find a bit of explanation for each feature, and links for more information here: |feature-list|. For the adventurous, edit the file "feature.h". You can also change the source code yourself!
es_es: Puede encontrar una explicación de cada funcionalidad y enlaces a más información aquí: |feature-list|. Para los atrevido, edite el archivo «feature.h». ¡También puede modificar el código fuente directamente!

source: There are two ways to install the Vim program for Microsoft Windows. You can uncompress several archives, or use a self-installing big archive. Most users with fairly recent computers will prefer the second method. For the first one, you will need:
es_es: Existen dos formas de instalar el programa Vim para Microsoft Windows. Puede descomprimir varios archivos, o usar un sólo archivo de instalación automática. La mayoría de usuarios con ordenadores relativamente recientes pueden preferir el segundo método. Se requiere lo siguiente para usar el primero:

source: - An archive with binaries for Vim. - The Vim runtime archive. - A program to unpack the zip files.
es_es: - Un archivo con binarios para Vim. - El archivo de tiempo de ejecución («runtime) de Vim. - Un programa para desempaquetar los archivos zip.

source: Or use the home site ftp.vim.org, if you think it's fast enough. Go to the "pc" directory and you'll find a list of files there. The version number is embedded in the file name. You will want to get the most recent version. We will use "61" here, which is version 6.1.
es_es: O use la página oficial ftp.vim.org si cree que es suficientemente rápido. Vaya al directorio «pc» y verá una lista de archivos. El número de versión se incluye en el nombre de archivo. Le recomendamos que obtenga la versión más reciente. En este documento se usará «61», la versión 6.1.

source: gvim61.exe The self-installing archive.
es_es: gvim61.exe El archivo de instalación automática.

source: This is all you need for the second method. Just launch the executable, and follow the prompts.
es_es: Esto es todo lo que necesita para el segundo método. Simplemente ejecute el archivo, y siga los diálogos.

source: For the first method you must chose one of the binary archives. These are available:
es_es: Debe escoger uno de los archivos binarios para realizar el primer método. Los siguientes están disponibles:

source: gvim61.zip The normal MS-Windows GUI version. gvim61ole.zip The MS-Windows GUI version with OLE support. Uses more memory, supports interfacing with other OLE applications. vim61w32.zip 32 bit MS-Windows console version. For use in a Win NT/2000/XP console. Does not work well on Win 95/98. vim61d32.zip 32 bit MS-DOS version. For use in the Win 95/98 console window. vim61d16.zip 16 bit MS-DOS version. Only for old systems. Does not support long filenames.
es_es: gvim61.zip La versión de interfaz gráfica normal de MS Windows. gvim61ole.zip La versión gráfica de MS Windows con compatibilidad con OLE. Usa más memoria, permite interactuar con otras aplicaciones OLE. vim61w32.zip La versión de consola de 32 bit para MS Windows. Para el uso en una consola Win NT/2000/XP console. No funciona bien en Win 95/98. vim61d32.zip Versión de 32 bit para MS-DOS. Para el uso en una ventana de consola de Win 95/98. vim61d16.zip Versión de 16 bit para MS-DOS. Sólo para sistemas antiguos. No permite el uso de nombres de archivo largos.

source: You only need one of them. Although you could install both a GUI and a console version. You always need to get the archive with runtime files.
es_es: Sólo necesita uno de estos. Aunque puede instalar la versión gráfica y una versión de intérprete de órdenes. Siempre necesita obtener el archivo con los archivos de tiempo de ejecución.

source: vim61rt.zip The runtime files.
es_es: vim61rt.zip Los archivos de tiempo de ejecución.

source: Use your un-zip program to unpack the files. For example, using the "unzip" program: >
es_es: Use su programa un-zip para descomprimir lso archivos. Por ejemplo, usando el programa «unzip»: >

source: This will unpack the files in the directory "c:\vim\vim61". If you already have a "vim" directory somewhere, you will want to move to the directory just above it. Now change to the "vim\vim61" directory and run the install program: >
es_es: Éstas órdenes desempaquetarán los ficheros en el directorio «c:\vim\vim61». Si ya tiene un directorio «vim», puede navegar al directorio superior a él. Ahora, entre al directorio «vim\vim61» y ejecute el programa de instalación: >
